In [19]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

# O erro ocorre porque o pd.read_sql do Pandas não suporta diretamente objetos de conexão do psycopg2

In [20]:
server = 'localhost'
database = 'python_etl_varias_bases'
user = 'postgres'
password = 'root'

try:
    engine = create_engine(f'postgresql://{user}:{password}@{server}/{database}')
    print("Conexão bem-sucedida ao PostgreSQL!")
except Exception as e:
    print("Erro ao conectar ao PostgreSQL:", e)

Conexão bem-sucedida ao PostgreSQL!

In [23]:
query = 'SELECT * FROM categorias'
categoria = pd.read_sql(query, engine)
categoria.head(10)

   id                     name
0   0        Moda e Acessórios
1   1  Cosméticos e Perfumaria
2   2         Eletrodomésticos
3   3                   Livros
4   4                Celulares
5   5              Informática
6   6         Casa e Decoração
7   7              Eletrônicos
8   8          Esporte e Lazer
9   9       Brinquedos e Games

In [33]:
query = """
    SELECT * FROM clientes WHERE 
    state in ('Acre', 'Mato_Grosso', 'Goiás', 'Maranhão')  
        AND 
    first_name in ('Stephanie', 'Laura', 'Heitor', 'Bruno')
"""
states = pd.read_sql(query, engine)
states.head(10)

,id,created_at,first_name,last_name,email,cell_phone,country,state,street,number,additionals
0,16,2017-12-12 21:29:54,Laura,Santos,laura@exemplo.com,9 7802-6152,Brasil,Maranhão,Rua 57 do Estado Maranhão,213.0,Sem infor
1,22,2018-04-18 22:43:29,Heitor,Pereira,Sem registro,9 4839-8118,Brasil,Maranhão,Avenida 84 do Estado Maranhão,948.0,Sem infor
2,52,2017-12-04 17:42:34,Bruno,Anjos,bruno@teste.com,9 3004-3740,Brasil,Goiás,Rua 53 do Estado Goiás,825.0,Sem infor
3,57,2018-08-23 03:31:05,Stephanie,Barboza,stephanie@meu_email.com,9 1168-6722,Brasil,Maranhão,Avenida 25 do Estado Maranhão,795.0,Sem infor